# TagViewId Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricArea..::..TagViewId Property
FabricArea Class See Also
---
The element of the view in which to tag new members of this element.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public ElementId TagViewId { get; set; }
```

Visual Basic
---
```text
Public Property TagViewId As ElementId
	Get
	Set
```

Visual C++
---
```text
public:
property ElementId^ TagViewId {
	ElementId^ get ();
	void set (ElementId^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | When setting this property: tagViewId is not a valid view for tagging the FabricArea or FabricSheets. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
FabricArea Class
Autodesk.Revit.DB.Structure Namespace